HMI V1.06/Assembly/SampleXML/assemble.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:r4="http://systemagmbh.com/manufacturing-automation/r4/">
   <soapenv:Header/>
   <soapenv:Body>
      <r4:assemble>
         <!--Optional:-->
         <assembleRequest>
            <!--Optional:-->
            <resourceId></resourceId>
            <!--Optional:-->
            <softwareRevision></softwareRevision>
            <!--Optional:-->
            <timeStamp></timeStamp>
            <!--Optional:-->
            <operation></operation>
            <!--Optional:-->
            <sfc></sfc>
            <!--Optional:-->
            <quantity></quantity>
         </assembleRequest>
         <isWithoutQty>False</isWithoutQty>
      </r4:assemble>
   </soapenv:Body>
</soapenv:Envelope>